def initialize_catalog():
    cars_catalog = []

    cars = [
        {
        "Модель": "Toyota Camry",
        "Класс": "седан",
        "Характеристики": {
            "Цена": 25000,
            "Объем двигателя": 2.5,
            "Время разгона до 100 км": 8.0,
            "Привод": "передний",
            "Год выпуска": "2023",
            "Страна производитель": "Япония"
        }
    }, 
        {
        "Модель": "Ford Mustang",
        "Класс": "купе",
        "Характеристики": {
            "Цена": 40000,
            "Объем двигателя": 5.0,
            "Время разгона до 100 км": 4.5,
            "Привод": "задний",
            "Год выпуска": "2022",
            "Страна производитель": "США"
        }
    },
        {
        "Модель": "BMW X5",
        "Класс": "внедорожник",
        "Характеристики": {
            "Цена": 60000,
            "Объем двигателя": 3.0,
            "Время разгона до 100 км": 6.0,
            "Привод": "полный",
            "Год выпуска": "2023",
            "Страна производитель": "Германия"
        }
    }, 
        {
        "Модель": "Chevrolet Cruze",
        "Класс": "седан",
        "Характеристики": {
            "Цена": 20000,
            "Объем двигателя": 1.8,
            "Время разгона до 100 км": 9.5,
            "Привод": "передний",
            "Год выпуска": "2022",
            "Страна производитель": "США"
        }
    }, 
        {
        "Модель": "Honda Civic",
        "Класс": "хэтчбек",
        "Характеристики": {
            "Цена": 22000,
            "Объем двигателя": 1,
            "Время разгона до 100 км": 7,
            "Привод": "передний",
            "Год выпуска": "2022",
            "Страна производитель": "Япония"
        }
    }, 
        {
        "Модель": "Audi Q7",
        "Класс": "внедорожник",
        "Характеристики": {
            "Цена": 70000,
            "Объем двигателя": 4,
            "Время разгона до 100 км": 5,
            "Привод": "полный",
            "Год выпуска": "2023",
            "Страна производитель": "Германия"
        }
    }, 
        {
        "Модель": "Mazda CX-5",
        "Класс": "внедорожник",
        "Характеристики": {
            "Цена": 30000,
            "Объем двигателя": 2,
            "Время разгона до 100 км": 8.5,
            "Привод": "полный",
            "Год выпуска": "2022",
            "Страна производитель": "Япония"
        }
    }, 
        {
        "Модель": "Mercedes-Benz C-Class",
        "Класс": "седан",
        "Характеристики": {
            "Цена": 50000,
            "Объем двигателя": 2.0,
            "Время разгона до 100 км": 6.5,
            "Привод": "задний",
            "Год выпуска": "2022",
            "Страна производитель": "Германия"
        }
    }, 
        {
        "Модель": "Volkswagen Golf",
        "Класс": "хэтчбек",
        "Характеристики": {
            "Цена": 23000,
            "Объем двигателя": 1.4,
            "Время разгона до 100 км": 8.8,
            "Привод": "передний",
            "Год выпуска": "2022",
            "Страна производитель": "Германия"
        }
    }, 
        {
        "Модель": "Hyundai Tucson",
        "Класс": "внедорожник",
        "Характеристики": {
            "Цена": 27000,
            "Объем двигателя": 2.0,
            "Время разгона до 100 км": 7.2,
            "Привод": "передний",
            "Год выпуска": "2022",
            "Страна производитель": "Южная Корея"
        }
    }
    ]
      
    cars_catalog.extend(cars)
    
    for car in cars_catalog:
        car["Рассрочка"] = False
    
    return cars_catalog
    

def find_cars(catalog, criteria, value):
    matching_cars = []
    
    for car in catalog:
        if criteria in car["Характеристики"] and car["Характеристики"][criteria] == value:
            matching_cars.append({"Модель": car["Модель"], "Класс": car["Класс"]})
    
    return matching_cars


def main():
    cars_catalog = initialize_catalog()

    search_criteria = "Год выпуска"
    search_value = "2022"

    result = find_cars(cars_catalog, search_criteria, search_value)

    for car in result:
        print("\nМодель:", car["Модель"])
        print("Класс:", car["Класс"])


if __name__ == "__main__":
    main()
